---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistV
source: html/08c0956c-0435-a460-f7e8-0d240ed61012.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtaingridUseCurveDistV Property

"Use Curve Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtaingridUseCurveDistV { get; }
```